# Modificare i valori delle colonne del *DataFrame*
E' possibile modificare tutti i valori di colonne specifiche del *DataFrame*

In [40]:
import pandas as pd

In [41]:
data = {
  'Name' : ["Liam", "Olivia", "Noah", "Emma", "Oliver", "Ava", "William", "Sophia", "Elijah", "Isabella", "James", "Charlotte", "Benjamin", "Amelia", "Lucas", "Mia", "Mason", "Harper"],
  'Time' : ['26.698', '26.971', '26.992', '27.018', '27.169', '27.237', '27.395', '27.487', '27.489', '27.521', '27.546', '27.567', '27.618', '27.793', '27.812', '27.865', '27.964', '27.993']
}

df = pd.DataFrame(data)

df

         Name    Time
0        Liam  26.698
1      Olivia  26.971
2        Noah  26.992
3        Emma  27.018
4      Oliver  27.169
5         Ava  27.237
6     William  27.395
7      Sophia  27.487
8      Elijah  27.489
9    Isabella  27.521
10      James  27.546
11  Charlotte  27.567
12   Benjamin  27.618
13     Amelia  27.793
14      Lucas  27.812
15        Mia  27.865
16      Mason  27.964
17     Harper  27.993

Viene creato un *DataFrame* con due colonne, entrambe aventi valori di tipo `string`

In [42]:
df.dtypes

Name    object
Time    object
dtype: object

## Convertire stringhe in numeri

Con la funzione `pd.to_numeric(list)` Ã¨ possibile convertire una lista di valori di tipo `string` in valori `int` o `float`

[Docs](https://pandas.pydata.org/docs/reference/api/pandas.to_numeric.html)

In [43]:
df['Time'] = pd.to_numeric(df['Time'])

df.dtypes

Name     object
Time    float64
dtype: object

## Operazioni base
Adesso possiamo eseguire operazioni sui valori del *DataFrame*

In [44]:
df['Time'] /= 60

df.head(3)

     Name      Time
0    Liam  0.444967
1  Olivia  0.449517
2    Noah  0.449867

In [45]:
df['Time'] += 1.5

df.head(3)

     Name      Time
0    Liam  1.944967
1  Olivia  1.949517
2    Noah  1.949867

In [46]:
df['Time'] -= 1

df.head(3)

     Name      Time
0    Liam  0.944967
1  Olivia  0.949517
2    Noah  0.949867

In [47]:
df['Time'] *= 2

df.head(3)

     Name      Time
0    Liam  1.889933
1  Olivia  1.899033
2    Noah  1.899733